backend copy/app/controllers/api/v1/corders_controller.rb

SELECT "corders".* FROM "corders"
---
    def index
        @corders = Corder.all

INSERT INTO "corders" ("customer_id", "total_paid", "paid_with", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["customer_id", 3], ["total_paid", 12.0], ["paid_with", "venmo"], ["product_id", 3], ["created_at", "2020-07-29 16:17:58.018761"], ["updated_at", "2020-07-29 16:17:58.018761"]]
---
    def create
        corder = Corder.create!(corder_params)