backend copy/app/controllers/api/v1/customers_controller.rb

    def show
        customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create

        # user_id = JWT.decode(token, "se042020")[0]["user_id"]
        # user = User.find(params[:id])

        # byebug
        customer = Customer.create!(customer_params)
---
INSERT INTO "customers" ("name", "phone", "email", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Kelli"], ["phone", "716-222-3333"], ["email", "TelliKelli@fake.com"], ["user_id", 1], ["created_at", "2020-07-29 15:11:50.249892"], ["updated_at", "2020-07-29 15:11:50.249892"]]