backend copy/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
      products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
      product = Product.find(params[:id])

INSERT INTO "products" ("name", "price", "color", "sku", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Tiny & Shiny"], ["price", 12], ["color", "Pink"], ["sku", "FMG142"], ["user_id", 1], ["created_at", "2020-07-29 19:01:27.580490"], ["updated_at", "2020-07-29 19:01:27.580490"]]
---
  def create
      product = Product.create!(product_params)