backend copy/app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)

    if user.valid?
      user.save
---
INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "company_name", "title", "tax_rate", "website_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "Block"], ["updated_at", "2020-07-29 20:30:35.850079"], ["id", 1]]