backend/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    def logged_in?
        # byebug

        headers = request.headers["Authorization"]
        # console.log("headers: ", headers)
        token = headers.split(" ")[1]

        begin
            #we were storing user_id in token
            #this gives us the user_id:
            user_id = JWT.decode(token, "se042020")[0]["user_id"]
            user = User.find(user_id)