backend/app/controllers/api/v1/corders_controller.rb

SELECT "corders".* FROM "corders"
---
    def index
        @corders = Corder.all