backend/app/controllers/api/v1/customers_controller.rb

INSERT INTO "customers" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Carol"], ["phone", "888-999-3333"], ["email", "Carol@fake.com"], ["created_at", "2020-07-28 15:45:47.989049"], ["updated_at", "2020-07-28 15:45:47.989049"]]
---
    def create
        customer = Customer.create!(customer_params)