backend/app/controllers/api/v1/items_controller.rb

    def index
        @items = Item.all
---
SELECT "items".* FROM "items"