backend/app/controllers/api/v1/porders_controller.rb

SELECT "porders".* FROM "porders"
---
        def index
            porders = Porder.all

INSERT INTO "porders" ("order_num", "total_paid", "description", "company_name", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
        def create
            porder = Porder.new(porder_params)

            if porder.valid?
              porder.save