backend/app/controllers/api/v1/products_controller.rb

    def index
        products = Product.all
---
SELECT "products".* FROM "products"

    def show
        product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        product = Product.new(product_params)

        if product.valid?
          product.save
---
INSERT INTO "products" ("name", "price", "color", "sku", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Tiny & Shiny"], ["price", 12], ["color", "Pink"], ["sku", "FMG142"], ["created_at", "2020-07-23 15:28:43.767182"], ["updated_at", "2020-07-23 15:28:43.767182"]]