backend/app/controllers/api/v1/purchaseorders_controller.rb

    def index
        purchaseorders = PurchaseOrder.all
---
SELECT "purchase_orders".* FROM "purchase_orders"