backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "company_name", "title", "tax_rate", "website_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    user = User.new(user_params)

    if user.valid?
      user.save